---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.HostCutoutForInsertionFailure
source: html/57d1cc04-67d6-9480-c987-06f76c74ad40.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.HostCutoutForInsertionFailure Property

Can't cut host for inserted objects

## Syntax (C#)
```csharp
public static FailureDefinitionId HostCutoutForInsertionFailure { get; }
```